# fraction reduce

Escreva uma função reduce que recebe uma tupla(numerador/denomidador) e devolve a fração após redução.

```hs
reduce (10,2) == (10,1)
reduce (15,6) == (5,2)
reduce (30,12) == (5,2)
reduce (120,48) == (5,2)
reduce (50,100) == (1,2)
```

## Testes

```txt
>>>>>>>>
10
2
========
(5,1)
<<<<<<<<

>>>>>>>>
120
48
========
(5,2)
<<<<<<<<
```## Testes

```txt
>>>>>>>>
(10,2)
========
(10,1)
<<<<<<<<

>>>>>>>>
(15,6)
========
(5,2)
<<<<<<<<

>>>>>>>>
(30,12)
========
(5,2)
<<<<<<<<

>>>>>>>>
(120,48)
========
(5,2)
<<<<<<<<

>>>>>>>>
(50,100)
========
(1,2)
<<<<<<<<

```
